package operator;

public class Test1 {
  public static void main(String[] args) {
    /*
    * 연산자 ( 계산 ? )
    *  1. 산술 연산자
    *     + : 더하기  , - : 뺴기 , *: 곱 , / 나누기 몫 , %: 나머지
    *     나머지 :  3 값을 2로 나눈 몫 , 나머지
    *
    *  2. 비교(관계) 연산자
    *     > , < , >= , <= , == , !=
    *     결과 = 참 , 거짓
    *  3. 논리ㄴ 연산자
    *     && 그리고 and , || 또는 or , ! not 부정
    *
    *  4. 대입(복합) 연산자
    *    변수 = 값 => 값을 변수에 대입해라(치화)
    *    a = a + 10 => 1. 뒤 a + 10 앞에 a 에 대입 해라
    *   
    *    예 ) int a = 10;
    *     a = a + 10  => 20 => a 에 대입
    *     a += 10 ;
    *     a = a - 10 => a -= 10
    *     a = a * 10 => a *= 10
    *     a = a / 10 => a /= 10
    *     a = a 5 10 => a %= 10
    *  5. 증감 연산자
    *     ++ : 1 증가
    *     -- : 1 감소
    *     a = a + 1 => a +=1 => ++a
    *     a = a - 1 => a -=1 => --a
    * 
    *     ++(--)변수 : 전위형
    *     변수++(--) : 후위형
    * 
    *  6. 삼항 연산자
    *   ( 조건 ) ? 참 : 거짓
    *
    * */
  }
}
